{
  "products": [
    {
      "id": "p1",
      "name": "Cредство для мытья посуды Crystal",
      "img": "img1.png",
      "sizeType": "volume",
      "sizeValue": "200 мл",
      "makersId": "m1",
      "brand": "Нэфис",
      "price": 47.45,
      "desc": "Современное, высокофункциональное средство с легкостью отмывает даже самые сложные загрязнения и глубоко въевшийся жир. Главной отличительной особенностью формулы 'AOS' является его безопасность, так как оно полностью смывается с поверхности посуды. Идеальное решение для тех, кто заботится о себе и своих близких. Сочетание высокой эффективности и натуральности с минимизацией потенциальных аллергенов и красителей. Отлично выполаскивается, посуда кристально чистая.",
      "categoriesId": [
        "t6",
        "t7"
      ]
    },
    {
      "id": "p2",
      "name": "Порошок стиральный Автомат 100 пятен COMPACT",
      "img": "img2.png",
      "sizeType": "weight",
      "sizeValue": "450 гр",
      "makersId": "m2",
      "brand": "Procter & Gamble",
      "price": 49.66,
      "desc": "Новые компакт-гранулы BiMAX побеждают любые пятна. В 1,5 раза меньше порошка нужно для стирки большего количества вещей и удаления самых сложных пятен. Уникальный комплекс энзимов позволяет отстирать более 100 видов пятен даже при меньшем расходе порошка.",
      "categoriesId": [
        "t9",
        "t7"
      ]
    },
    {
      "id": "p3",
      "name": "Автмат Гель СМС жидкое в растворимых капсулах Liquid Capsules Горный родник",
      "img": "img3.png",
      "sizeType": "weight",
      "sizeValue": "15X28.8 гр",
      "makersId": "m2",
      "brand": "Procter & Gamble",
      "price": 48.99,
      "desc": "Капсулы для стирки Ariel PODs Все-в-1 + Revitablack восстанавливают яркость черного и других темных цветов благодаря технологии восстановления волокон ткани даже при стирке в холодной воде. Каждая невероятно эффективная капсула с уникальным многокомпонентным дизайном обеспечивает стабильность ингредиентов, не давая им смешиваться до стирки.\n\nИнновационная пленка капсул для стирки Ariel PODs +Revitablack полностью растворяется при контакте с водой, позволяя мощным технологиям бережно ухаживать за черной и темной одеждой. Одна капсула содержит необходимую для стирки дозу лучшего жидкого средства для стирки от Ariel. Для эффективного использования продукта сначала поместите в барабан капсулу, а затем загрузите одежду.",
      "categoriesId": [
        "t9",
        "t7"
      ]
    },
    {
      "id": "p4",
      "name": "Жидкое мыло для рук и тела SYNERGETIC Карамельное яблоко и ваниль увлажняющее, натуральное",
      "img": "img6.jpg",
      "sizeType": "volume",
      "sizeValue": "380 мл",
      "makersId": "m4",
      "price": 33.34,
      "desc": "Натуральное биоразлагаемое мыло для рук и тела SYNERGETIC «Карамельное яблоко и ваниль» — это деликатное средство для очищения кожи, на 99,2% состоящее из натуральных компонентов. Гипоаллергенный аромат натурального мыла разработан в швейцарском доме Givaudan с использованием натуральных эфирных масел померанца, корицы и лимона. Масла макадамии, гранатовых косточек и экстракты ванили и яблока оказывают регенерирующее действие, питают и увлажняют сухую кожу, делая ее гладкой и бархатистой. Софоролипид из рапсового масла мягко очищает и сохраняет естественный микробиом кожи. Уникальный комплекс натуральных компонентов на основе глицерина и растительных сахаров обеспечивает длительный смягчающий эффект до 72 часов. Физиологичный уровень pH 5,5 гарантирует мягкость кожи и безопасность при частом использовании даже для чувствительной кожи. Натуральное мыло сертифицировано британской организацией The Vegan Society. Знак Vegan – мировой стандарт этичной продукции.",
      "categoriesId": [
        "t1",
        "t2",
        "t5"
      ]
    },
    {
      "id": "p5",
      "name": "Натуральный крем SYNERGETIC для рук и тела Сандал и ягоды можжевельника",
      "img": "img4.jpg",
      "sizeType": "volume",
      "sizeValue": "380 мл",
      "makersId": "m3",
      "brand": "ООО «Синергетик»",
      "price": 55.56,
      "desc": "Натуральный крем для рук и тела SYNERGETIC \"Сандал и ягоды можжевельника\" обеспечивает эффективное увлажнение и дарит коже ощущение комфорта. Изомерат сахарида регулирует увлажненность кожи, обеспечивает сохранение влаги и восстанавливает барьерные функции кожи.Комплекс натуральных масел ши, макадамии и сладкого миндаля интенсивно питает и смягчает сухую и чувствительную кожу, делая ее идеально гладкой и шелковистой. Экстракты сандалового дерева и можжевельника обладают тонизирующим действием и повышают эластичность и упругость кожи.Натуральный пребиотик инулин нормализует и поддерживает естественный микробиом кожи.Парфюмерная композиция с эфирными маслами коричника китайского, имбиря, гвоздики, мускатного ореха, мирры и пачули оставляет на коже приятный аромат.Натуральный крем дерматологически протестирован независимым институтом в Германии. Он не содержит силиконов, парабенов, минеральных масел, красителей, компонентов животного происхождения, не тестируется на животных и сертифицирован британской организацией The Vegan Society. Знак Vegan — мировой стандарт этичной продукции.",
      "categoriesId": [
        "t2",
        "t1"
      ]
    },
    {
      "id": "p6",
      "name": "Soft Интенсивный увлажняющий крем, для лица, рук и тела, с маслом жожоба и витамином Е",
      "img": "img5.jpg",
      "sizeType": "volume",
      "sizeValue": "100 мл",
      "brand": "Beiersdorf AG",
      "makersId": "m3",
      "price": 41.34,
      "desc": "Так приятно, когда находишь средство, идеально подходящее не только для кожи рук, но и для тела и лица! Попробуйте наш универсальный увлажняющий крем NIVEA SOFT - высокоэффективный интенсивный увлажняющий крем для ежедневного использования. Легкая формула с витамином Е и маслом жожоба быстро впитывается, делая кожу невероятно мягкой и гладкой, и освежает кожу. Наслаждайтесь бодрящим ощущением мягкой и эластичной кожи. Легкий ненавязчивый аромат подойдет для всех членов семьи. Применение: небольшое количество средства нанести мягкими массирующими движениями на кожу лица, рук или тела, дать впитаться в течение 1-2 минут. Не стоит использовать сразу большое количество - от этого кожа не впитает в себя больше, а остатки будут находиться на поверхности, предоставляя вам дискомфорт.",
      "categoriesId": [
        "t1",
        "t2",
        "t4"
      ]
    },
    {
      "id": "p7",
      "name": "Крем для рук Nivea Защита и забота 3в1, антибактериальный, для нормальной и сухой кожи",
      "img": "img7.jpg",
      "sizeType": "volume",
      "sizeValue": "80 мл",
      "makersId": "m3",
      "brand": "Beiersdorf AG",
      "price": 49.88,
      "desc": "Наши руки нуждаются в особой защите и бережном уходе. Проверенную заботу в сочетании с антибактериальным эффектом вы найдете в новом креме для рук 3в1 Защита и Забота от Nivea. Крем станет вашим надежным помощником в питании, увлажнении и укреплении защитного барьера кожи. Формула крема усилена антибактериальными свойствами, при этом не содержит спирта. Легкая и нежная эмульсия борется с сухостью кожи рук, а масло жожоба в составе, известное своим ухаживающим действием, питает и обеспечивает глубокое увлажнение. Удобный и экономичный формат тюбика позволит использовать крем целиком, до последней капли. Результат - защита от бактерий и здоровая кожа после каждого применения. Nivea - новая рутина в уходе за кожей рук!",
      "categoriesId": [
        "t2"
      ]
    },
    {
      "id": "p8",
      "name": "Натуральный крем для ног SYNERGETIC смягчающий для сухой и потрескавшейся кожи",
      "img": "img7.jpg",
      "sizeType": "volume",
      "sizeValue": "125 мл",
      "makersId": "m3",
      "brand": "ООО «Синергетик»",
      "price": 33.88,
      "desc": "Натуральный крем для ног SYNERGETIC смягчающий для сухой и потрескавшейся кожи эффективно питает и увлажняет, насыщает полезными микроэлементами, способствует заживлению и бережно защищает от раздражений и воспалений. Безопасная формула с высокой концентрацией натуральных компонентов содержит пребиотик трегалозу, который нормализует и сохраняет естественный микробиом кожи. Масла авокадо и оливы способствуют активному смягчению кожи ног и улучшают её внешний вид. Экстракты розмарина и каштана обладают антиоксидантными и тонизирующими свойствами. Благодаря нежной текстуре средство легко наносится и равномерно распределяется по коже, хорошо впитывается и не оставляет жирной пленки.",
      "categoriesId": [
        "t3"
      ]
    },
    {
      "id": "p9",
      "name": "Гель для стирки Ariel Масло Ши, 1.3 л",
      "img": "img9.jpeg",
      "sizeType": "weight",
      "sizeValue": "1356 гр",
      "makersId": "m2",
      "brand": "Procter & Gamble",
      "price": 58.88,
      "desc": "Гель-концентрат Ariel аромат масла ши для цветных тканей - превосходное и бережное средство для стирки одежды и белья с мягким ароматом. В отличие от обычного стирального порошка, гель Ариэль сразу попадает в барабан стиральной машины и быстро растворяется в воде. Он эффективно отстирывает на коротких циклах стирки, беспощадно устраняет загрязнения – основную причину неприятных запахов, таких как запах пота – и придает одежде сияющую чистоту и аромат, вдохновленный природой. Если у вас чувствительная кожа, рекомендуем обратить внимание на гипоаллергенную коллекцию Ariel для чувствительной кожи.\n",
      "categoriesId": [
        "t9"
      ]
    },
    {
      "id": "p10",
      "name": "крем-гель для душа питательный Сладкая клубника и мята, смягчает, питает, тонизирует",
      "img": "img10.jpg",
      "sizeType": "volume",
      "sizeValue": "750 мл",
      "makersId": "m5",
      "brand": "Концерн «Калина»",
      "price": 35.78,
      "desc": "Насладитесь душем с невероятно сочным ароматом клубники и мяты, который подарит вам питательный крем-гель для душа Чистая Линия.\nПродукт на 100% натуральной основе1, которая мягко и бережно очищает кожу2. Обновленная формула содержит 97% компонентов натурального происхождения, в том числе сок клубники, экстракт мяты и эссенцию 5 экстрактов и масел Nature Plus.\n",
      "categoriesId": [
        "t1",
        "t7"
      ]
    },
    {
      "id": "p11",
      "name": "Средство для мытья посуды SYNERGETIC Сочное яблоко 1 л, антибактериальное, гипоаллергенное, биоразлагаемое, эко, моющее",
      "img": "img11.jpg",
      "sizeType": "volume",
      "sizeValue": "1000 мл",
      "makersId": "m4",
      "brand": "ООО «Синергетик»",
      "price": 35.78,
      "desc": "Концентрированный гель для посуды с антибактериальным эффектом SYNERGETIC – это экологичное, безопасное и эффективное средство для мытья всех видов посуды (в том числе детской), кухонного инвентаря и детских игрушек от любых видов загрязнений.Мягкие биоразлагаемые тензиды из растительного масла обеспечивают хорошее пенообразование и эффективно удаляют жир и запахи даже в холодной воде.Растительный глицерин в составе средства защищает кожу рук от сухости и раздражения.Международный экологический сертификат ICEA подтверждает биоразлагаемость, безопасность и эффективность средства. Полностью смывается водой. Дерматологически протестировано в Европе (протокол испытаний № 18/000493914 от 15.11.2018 г.).Биоразлагаемые компоненты не вредят микрофлоре септических установок.",
      "categoriesId": [
        "t7",
        "t6"
      ]
    },
    {
      "id": "p12",
      "name": "Таблетки для посудомоечной машины BioMio BIO-TOTAL 7-в-1 эвкалипт",
      "img": "img12.jpg",
      "sizeType": "weight",
      "sizeValue": "6,9х23,5х23,8",
      "makersId": "m6",
      "brand": "ООО «Сплат-Косметика»",
      "price": 89.78,
      "desc": "Экологичные таблетки для посудомоечной машины 7-в-1 BIO-TOTAL с эфирным маслом эвкалипта эффективно и деликатно, с заботой о посуде удаляют самые стойкие загрязнения даже при низких температурах, придавая дополнительный блеск и сияние стеклу, нержавующей стали, нейтрализуя запахи.\nТаблетки быстро растворяются в воде, смягчая ее, тем самум предупреждая образование изветскового налета, способстсвуя более надежной и долговечной работе машины;\n\n\nBioMio - линейка эффективных средств для дома, использование которых приносит удовольствие. Продукты, созданные с любовью и заботой, идеально справятся с загрязнениями, оставаясь при этом абсолютно безопасными, экологичными и особенно незаменимыми, если в доме есть малыш.\nРекомендации по применению: промойте сильно загрязненную посуду. Положите 1 таблетку в предусмотренное отделение вашей посудомоечной машины. Выберите соответствующую программу для мытья посуды и запустите машину. Подходит для разных температурных режимов (50-70°С). В регионах с жесткой водой добавьте соль и ополаскиватель в машину.",
      "categoriesId": [
        "t7",
        "t6"
      ]
    },
    {
      "id": "p13",
      "name": "Подарочный набор SYNERGETIC Комбо для домашнего SPA для очищения, увлажнения и ухода за кожей рук и тела",
      "img": "img13.jpg",
      "sizeType": "weight",
      "sizeValue": "1209 г",
      "makersId": "m4",
      "brand": "ООО «Синергетик»",
      "price": 48.98,
      "desc": "Любите благородные древесные запахи с нотками хвои? Тогда набор натуральных средств SYNERGETIC с ароматом «Сандал и ягоды можжевельника» идеально подойдет для вашего домашнего SPA.Парфюмерные композиции SYNERGETIC созданы на основе эфирных масел швейцарского парфюмерного дома Givaudan и оставляют на коже приятные ароматные нотки. В набор входит натуральный гель для душа, скраб для тела и крем для рук и тела.Экстракты сандалового дерева и можжевельника в составе геля для душа увлажняют кожу и оказывают тонизирующий эффект.Скраб для тела подарит вашей коже эластичность и сияние. Он деликатно отшелушивает и очищает кожу, помогая ей обновляться. Масло карите в его составе оказывает регенерирующее действие, делает кожу гладкой и бархатистой.Натуральный крем для рук и тела станет важным завершающим этапом заботы о коже: обеспечит увлажнение, тонизирует и восстановит барьерные функции кожи.",
      "categoriesId": [
        "t1",
        "t2",
        "t5",
        "t8"
      ]
    },
    {
      "id": "p14",
      "name": "Гель для стирки детского белья BioMio Baby Bio-Sensitive, экологичный, антибактериальный",
      "img": "img14.jpg",
      "sizeType": "volume",
      "sizeValue": "1209 мл",
      "makersId": "m6",
      "brand": "ООО «Сплат-Косметика»",
      "price": 57.98,
      "desc": "Экологичный гель для стирки детских вещей BIO-SENSITIVE BABY с кондиционирующим эффектом - это эффективное средство, которое идеально подходит для стирки детских вещей и одежды людей с чувствительной кожей. Он бережно очищает волокна, сохраняя форму и цвет тканей.Специальная формула с лизатами пропионовокислых бактерий нормализует микробиоту кожи рук, а экстракт хлопка придает мягкость тканям.",
      "categoriesId": [
        "t9",
        "t7"
      ]
    },
    {
      "id": "p15",
      "name": "Матирующий гель для умывания, для склонной к жирности кожи",
      "img": "img15.jpg",
      "sizeType": "volume",
      "sizeValue": "120 мл",
      "makersId": "m3",
      "brand": "Beiersdorf AG",
      "price": 31.98,
      "desc": "Более 100 лет Nivea разрабатывает особенно бережные формулы для заботы о вашей коже. Матирующий гель для умывания Nivea Бережное очищение для склонной к жирности кожи с морскими водорослями и мягкой водой - идеален для ежедневного ритуала ухода за кожей, - бережного очищения кожи и избавления от жирного блеска. Умывание без сухости кожи и поддержка естественного баланса увлажненности. Эффективная формула мягко очищает кожу от загрязнений. Кожа чистая, выглядит здоровой и дышит свободно! Применение: небольшое количество средства выдавить на ладони, массирующими движениями нанести на лицо, смыть водой. Средство предназначено для избавления кожи от ежедневных негативных воздействий окружающей среды на кожу и остатков макияжа. Не является средством для снятия макияжа.",
      "categoriesId": [
        "t4",
        "t5"
      ]
    },
    {
      "id": "p16",
      "name": "Nivea Матирующий гель для умывания, для склонной к жирности кожи",
      "img": "img16.jpg",
      "sizeType": "volume",
      "sizeValue": "150 мл",
      "makersId": "m3",
      "brand": "Beiersdorf AG",
      "price": 49.98,
      "desc": "Подарочный набор Nivea «Увлажнение и уход» включает универсальный крем Nivea Soft и бальзам для губ. Интенсивный увлажняющий крем подходит для ежедневного использования. \n\nЛегкая формула с витамином Е и маслом жожоба быстро впитывается, делая кожу невероятно мягкой и гладкой. Наслаждайтесь ощущением мягкой и эластичной кожи. Легкий ненавязчивый аромат подойдет для всех членов семьи. \n\nБальзам с ценными маслами авокадо, жожоба и дерева ши обеспечивает ровную текстуру, которая мгновенно тает на губах. Увлажняет их в течение 24 часов и предотвращает потерю влаги, сохраняет их мягкими и нежными.",
      "categoriesId": [
        "t2",
        "t3",
        "t4",
        "t8"
      ]
    },
    {
      "id": "p17",
      "name": "мицеллярная вода 3в1 для всех типов кожи с гиалуроном и экстрактом розы, успокаивающая",
      "img": "img17.jpg",
      "sizeType": "volume",
      "sizeValue": "400 мл",
      "makersId": "m5",
      "brand": "Концерн «Калина»",
      "price": 49.98,
      "desc": "Попробуйте уход и очищение с мицеллярной водой 3 в 1, которая эффективно снимает макияж, успокаивает и смягчает. Эксперты бренда Чистая Линия разработали средство для снятия макияжа, в составе которого 97% компонентов натурального происхождения*, в том числе эссенция из пяти экстрактов и масел NATURE PLUS (экстракт вербены, экстракт пиона, масла миндаля, льна, оливы), экстракт лепестков розы и гиалурон. Активные натуральные компоненты питают, восстанавливают липидный барьер, предотвращая появление мелких морщинок.",
      "categoriesId": [
        "t4",
        "t5"
      ]
    },
    {
      "id": "p18",
      "name": "ECO Гель для мытья посуды AOS Экстракт хлопка, SPA уход для нежной кожи рук, с дозатором, без красителей и фосфатов, ЭКО",
      "img": "img18.jpg",
      "sizeType": "volume",
      "sizeValue": "900 мл",
      "makersId": "m1",
      "brand": "Нэфис",
      "price": 29.98,
      "desc": "Бренд AOS в декабре 2022 года четвертый раз признан «Маркой № 1 в России» в категории «Средство для мытья посуды». Моющее средство для посуды AOS Экстракт хлопка с дозатором это первый ЭКО SPA продукт, который не только ухаживает за руками, но и эффективно справляется с горой грязной посуды, пригоревшим жиром и неприятными пищевыми запахами. Формула геля разработана таким образом, что растительные активные вещества эффективно работают на любых типах посуды и при любой температуре воды. Биоразлагаемый состав не оставляет химического следа в почве. Природный экстракт хлопка деликатно воздействует на кожу рук, увлажняя ее и защищая от пересушивания и раздражения. Обильная густая пена позволяет отмыть большее количество тарелок, что способствует экономному расходу средства. Бренд AOS занимает одну из лидирующих позиции в основных категориях рынка бытовой химии. При создании этого моющего средства ученым-технологам удалось добиться важного качественного преимущества. Отличительная особенность АОS в том, что он отлично отмывает жир и грязь и сам полностью смывается водой, обеспечивая экологическую безопасность вымытой посуды. В 2005 году AOS занесен в Книгу рекордов России как самое экономичное средство для мытья посуды. Одной бутылочкой АОS 500 мл. для посуды было отмыто 9664 тарелок, это абсолютный рекорд. Средство для посуды AOS становилось многократным победителем отраслевых конкурсов, тестирующих качество продуктов бытовой химии «Бытхимэкспо», «100 лучших товаров» России и несколько раз признавалось победителем в национальном конкурсе предпочтений потребителей и получал премию «Марка №1 в России».",
      "categoriesId": [
        "t7",
        "t6"
      ]
    }
  ],
  "makers": [
    {
      "id": "m1",
      "name": "AOS"
    },
    {
      "id": "m2",
      "name": "Ariel"
    },
    {
      "id": "m3",
      "name": "Nivea"
    },
    {
      "id": "m4",
      "name": "SYNERGETIC"
    },
    {
      "id": "m5",
      "name": "Чистая Линия"
    },
    {
      "id": "m6",
      "name": "BioMio"
    }
  ],
  "categories": [
    {
      "id": "t1",
      "name": "Уход за телом"
    },
    {
      "id": "t2",
      "name": "Уход за руками"
    },
    {
      "id": "t3",
      "name": "Уход за ногами"
    },
    {
      "id": "t4",
      "name": "Уход за лицом"
    },
    {
      "id": "t9",
      "name": "Средства для стирки"
    },
    {
      "id": "t5",
      "name": "Гигиеническая продукция"
    },
    {
      "id": "t6",
      "name": "Средства для мытья посуды"
    },
    {
      "id": "t7",
      "name": "Бытовая химия"
    },
    {
      "id": "t8",
      "name": "Подарочные наборы"
    }
  ],
  "login": {
    "login": "user",
    "password": "123456",
    "accessToken": "eyJ0eXAiOiJKV1"
  }
}